test/cylinder15000/baseline/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0; 
    format      ascii;
    class       dictionary; 
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel	Newtonian; 
nu               1.01e-6; //[0 2 -1 0 0 0 0]
beta	beta [0 0 0 -1 0 0 0] 0.003;  
rhoRef	rhoRef [1 -3 0 0 0 0 0] 1000;

com  0;
rho  1000;
Uc   1.515;
Lc   0.01;
Tref  298;
readT 0;

// ************************************************************************* //
