test/cylinder15000/baseline/system/decomposeParDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	decomposeParDict;
}
numberOfSubdomains 5;

method          scotch; 

simpleCoeffs
{
    n               (4 1 2);
    delta           0.001;
}

distributed     no;

roots           ( );

