test/cylinder15000/baseline/system/fvSchemes
FoamFile
{
	version	2.0;
	class	dictionary;  
	format	ascii;
	location	"system"; 
	object	fvSchemes;  
}
ddtSchemes 
{
	default	backward;//CrankNicolson 0.9;//Euler;
}
gradSchemes  
{
	default	Gauss linear; 
}
divSchemes
{
	div(phi,U)	 Gauss linearUpwind grad;
	div(phiMean,UMean) Gauss linearUpwind grad;
	div(phi,k)	 Gauss linearUpwind grad;
	div(phi,omega)	 Gauss linearUpwind grad;
	div(phi,gammaInt)	 Gauss linearUpwind grad;
	div(phi,ReThetat)	 Gauss linearUpwind grad;
	div((nuEff*dev(T(grad(U)))))	Gauss linear;
	div((nuEff*dev2(T(grad(U)))))	Gauss linear;
	div(R)	Gauss linearUpwind grad;
}
laplacianSchemes
{
	default	Gauss linear corrected;
}
interpolationSchemes
{
	default	linear;
}
snGradSchemes
{
	default	corrected;
}
wallDist
{
	method	meshWave;
	nRequired	true;
}
