test/cylinder15000/baseline/system/fvSolution
FoamFile
{
	version	2.0; 
	class	dictionary;  
	format	ascii;
	location	"system"; 
	object	fvSolution;   
}
solvers
{
    p 
    {
    solver PCG;     //共轭梯度求解器（使用对称矩阵，否则 PBICG）
    preconditioner
    {
        preconditioner GAMG;     //代数网格预条件器
        tolerance 1e-07;         //预条件器绝对残差
        relTol 0.0;                //预条件器相对残差
        smoother DICGaussSeidel;
        nPreSweeps 0;
        nPostSweeps 2;
        nFinestSweeps 2;
        cacheAgglomeration false;     //可以改为 true，用内存换时间
        nCellsInCoarsestLevel 10;
        agglomerator faceAreaPair;
        mergeLevels 1;
    }
    tolerance 1e-05;     //绝对残差
    relTol 0;            //相对残差
    maxIter 100;         //最大迭代数目，一般而言，该求解器可以保证在100步以内收敛
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|omega|gammaInt|ReThetat)"
    {
    solver  PBiCG;
    preconditioner DILU;
    tolerance 1e-06;
    relTol 0;
    }

    "(U|k|omega|gammaInt|ReThetat)Final"
    {
        $U;
        relTol          0;
    }
}
PISO
{
  nCorrectors     2;
  nOuterCorrectors    1;
  nNonOrthogonalCorrectors 2;
	pRefCell	0;
	pRefValue	101325.0;

}

PIMPLE
{
  nCorrectors     2;
  nOuterCorrectors    50;
  nNonOrthogonalCorrectors 2;
	pRefCell	0;
	pRefValue	101325.0;
 	residualControl
	{
		p
		{
			tolerance	1.0E-4;
			relTol	0.0;
		}
		U
		{
			tolerance	1.0E-4;
			relTol	0.0;
		}
		h
		{
			tolerance	1.0E-5;
			relTol	0.0;
		}
		rho
		{
			tolerance	1.0E-4;
			relTol	0.0;
		}
		k
		{
			tolerance	1.0E-4;
			relTol	0.0;
		}
		omega
		{
			tolerance	1.0E-4;
			relTol	0.0;
		}
		ReThetat
		{
			tolerance	1.0E-4;
			relTol	0.0;
		}
		gammaInt
		{
			tolerance	1.0E-4;
			relTol	0.0;
		}
	}

}

residualControl
{
		p	1.0E-4; 
		k	1.0E-5;
		T	1.0E-5;
		U	1.0E-4;
		omega	1.0E-4;
}
relaxationFactors
{
    equations
    {
         U        0.5;
    }
    fields
    {
         p        0.3;
    }
}
